app/controllers/users_controller.rb

	def create
		@user = User.new(params[:user].permit!)
		redirect_to @user if @user.save
---
INSERT INTO "users" ("created_at", "email", "password", "updated_at", "username") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 14 Jul 2013 00:05:14 UTC +00:00], ["email", "row@row.com"], ["password", "row"], ["updated_at", Sun, 14 Jul 2013 00:05:14 UTC +00:00], ["username", "row"]]